### 16 - Time Methods

In [2]:
#import the time library
import numpy as np
import pandas as pd
from datetime import datetime

In [3]:
#create a bunch of variables for time
myyear = 2015
mymonth = 1
myday = 1
myhour  = 5
mymin = 30
mysec = 15

In [5]:
mydate = datetime(myyear, mymonth ,myday)
mydate

datetime.datetime(2015, 1, 1, 0, 0)

In [8]:
mydatetime = datetime(myyear, mymonth ,myday, myhour, mymin, mysec)
mydatetime

datetime.datetime(2015, 1, 1, 5, 30, 15)

In [9]:
#attributes of time
mydatetime.year

2015

In [12]:
#create on pandas
myser = pd.Series(["Jan 01, 2000", "2001-02-15", "Mar 30, 2002"])
myser

0    Jan 01, 2000
1      2001-02-15
2    Mar 30, 2002
dtype: object

In [15]:
#convert to datetime
timeser = pd.to_datetime(myser, format='mixed')
timeser

0   2000-01-01
1   2001-02-15
2   2002-03-30
dtype: datetime64[ns]

In [18]:
print(timeser[0].year)
print(timeser[1].year)
print(timeser[2].year)

2000
2001
2002

In [20]:
euro_date = '10-12-2000'
pd.to_datetime(euro_date, dayfirst = True)

Timestamp('2000-12-10 00:00:00')

In [21]:
outdated_date = '12--Dec--2000'

In [22]:
pd.to_datetime(outdated_date, format='%d--%b--%Y')

Timestamp('2000-12-12 00:00:00')

In [23]:
custom_date = "12th of Dec 2000"
pd.to_datetime(custom_date)

Timestamp('2000-12-12 00:00:00')

#### Trying it on real data

In [26]:
sales = pd.read_csv('RetailSales_BeerWineLiquor.csv')
sales

           DATE  MRTSSM4453USN
0    1992-01-01           1509
1    1992-02-01           1541
2    1992-03-01           1597
3    1992-04-01           1675
4    1992-05-01           1822
..          ...            ...
335  2019-12-01           6630
336  2020-01-01           4388
337  2020-02-01           4533
338  2020-03-01           5562
339  2020-04-01           5207

[340 rows x 2 columns]

In [29]:
#convert object to data
sales['DATE'] = pd.to_datetime(sales["DATE"])
sales['DATE']

0     1992-01-01
1     1992-02-01
2     1992-03-01
3     1992-04-01
4     1992-05-01
         ...
335   2019-12-01
336   2020-01-01
337   2020-02-01
338   2020-03-01
339   2020-04-01
Name: DATE, Length: 340, dtype: datetime64[ns]

In [30]:
#reading in date of csv file
sales = pd.read_csv('RetailSales_BeerWineLiquor.csv', parse_dates=[0])

In [32]:
sales.head()

        DATE  MRTSSM4453USN
0 1992-01-01           1509
1 1992-02-01           1541
2 1992-03-01           1597
3 1992-04-01           1675
4 1992-05-01           1822